# MechanicalFitting Properties

---
The MechanicalFitting type exposes the following members.
| Name| Description
---|---|---
| ConnectorManager|  Retrieves the Connector Manager from this MEPModel. (Inherited from MEPModel)
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from MEPModel)
| PartType| The part type of the mechanical fitting.
Top
#### Reference
MechanicalFitting Class
Autodesk.Revit.DB.Mechanical Namespace